# TimeZone Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..TimeZone Property
SunAndShadowSettings Class See Also
---
Identifies the time zone.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double TimeZone { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TimeZone As Double
	Get
```

Visual C++
---
```text
public:
property double TimeZone {
	double get ();
}
```

# Remarks
Identifies the time zone used by the SunAndShadowSettings element. This property indicates the time zone in which the site resides. The value is in hours, ranging from +12 hours to -12 hours with 0 being GMT.
# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace